update l2ps sw arch doc
